app/controllers/pages_controller.rb

SELECT * FROM "pages" WHERE (parent_id IS NULL)
---
  def index
    if logged_in?
      @pages = Page.all

SELECT * FROM "pages" WHERE ("pages".parent_id = 1)
SELECT count(*) AS count_all FROM "pages" WHERE ("pages".parent_id = 1)
---
  def show
      @page = Page.find(params[:id])

INSERT INTO "pages" ("name", "created_at", "updated_at", "parent_id", "content") VALUES('Преподаватели', '2010-06-17 12:56:41', '2010-06-17 12:56:41', NULL, 'трооо')
---
  def create
    @page = Page.new(params[:page])
    if @page.save

SELECT * FROM "pages" WHERE (parent_id IS NULL)
---
  def edit
    if logged_in?
      @page = Page.find(params[:id])

SELECT * FROM "pages" WHERE ("pages"."id" = 3)
UPDATE "pages" SET "updated_at" = '2010-06-17 13:34:53', "content" = 'The line, operating in test mode since the start of the year, will produce HP, HP Pro and Compaq models. It will initially employ 100 workers, although the staff will grow as production increases.
---
  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(params[:page])

SELECT * FROM "pages" WHERE ("pages".parent_id = 2)
DELETE FROM "pages" WHERE "id" = 2
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy